In [1]:
import pandas as pd

In [3]:
pwd

'/Users/btodd/Repos/Python-DataScience-MachineLearning/Section-6-Pandas'

In [5]:
# Reading a csv file
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df = pd.read_csv('example')

In [8]:
# Index = False means to not save the index
df.to_csv('my_output', index = False)

In [12]:
# Passing sheet_name lets you pull certain sheets
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [20]:
# Here we are reading HTMl data passed through pandas, it is looking at the table in the HTML
data = pd.read_html('https://www.fdic.gov/bank-failures/failed-bank-list')

In [21]:
data[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund
0,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
1,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
2,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
3,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543
4,Signature Bank,New York,New York,57053,"Flagstar Bank, N.A.","March 12, 2023",10540

In [22]:
from sqlalchemy import create_engine

In [23]:
engine = create_engine('sqlite:///:memory:')

In [24]:
df.to_sql('my_table', engine)

4

In [25]:
sqldf = pd.read_sql('my_table', con=engine)

In [ ]:
s